## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform
To view this run in a browser, visit:
https://app.terraform.io/app/OzOrgTest/TestOzOrg/runs/run-jo9HfmyxiUQckSAx

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.rdc_vnets.module.example_vnet.module.vnets.azapi_resource.vnet will be created
  + resource "azapi_resource" "vnet" {
      + body                      = {
          + extendedLocation = null
          + properties       = {
              + addressSpace         = {
                  + addressPrefixes = [
                      + "10.42.0.0/16",
                    ]
                }
              + bgpCommunities       = null
              + ddosProtectionPlan   = null
              + dhcpOptions          = {
                  + dnsServers = [
                      + "8.8.8.8",
                    ]
                }
              + enableDdosProtection = false
              + enableVmProtection   = false
              + encryption           = null
              + flowTimeoutInMinutes = null
            }
        }
      + create_headers            = {
          + "User-Agent" = (known after apply)
        }
      + delete_headers            = {
          + "User-Agent" = (known after apply)
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + location                  = "East US"
      + name                      = "vnet-example"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/4bcc135f-80a8-482f-b67b-fc849aa4b7ac/resourceGroups/Testrg1"
      + read_headers              = {
          + "User-Agent" = (known after apply)
        }
      + response_export_values    = []
      + retry                     = {
          + error_message_regex  = [
              + "ReferencedResourceNotProvisioned",
            ]
          + interval_seconds     = 10
          + max_interval_seconds = 180
          + multiplier           = 1.5
          + randomization_factor = 0.5
        }
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.Network/virtualNetworks@2024-07-01"
      + update_headers            = {
          + "User-Agent" = (known after apply)
        }

      + timeouts {
          + create = "30m"
          + delete = "30m"
          + read   = "5m"
          + update = "30m"
        }
    }

  # module.rdc_vnets.module.example_vnet.module.vnets.modtm_telemetry.telemetry[0] will be created
  + resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
      + id               = (known after apply)
      + nonce            = (known after apply)
      + tags             = {
          + "location"        = "East US"
          + "module_source"   = "registry.terraform.io/Azure/avm-res-network-virtualnetwork/azurerm"
          + "module_version"  = "0.16.0"
          + "random_id"       = (known after apply)
          + "subscription_id" = "4bcc135f-80a8-482f-b67b-fc849aa4b7ac"
          + "tenant_id"       = "71356f31-4de2-4bc5-9778-f530a487e6dc"
        }
    }

  # module.rdc_vnets.module.example_vnet.module.vnets.random_uuid.telemetry[0] will be created
  + resource "random_uuid" "telemetry" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.rdc_vnets.module.that.module.vnets.azapi_resource.vnet will be created
  + resource "azapi_resource" "vnet" {
      + body                      = {
          + extendedLocation = null
          + properties       = {
              + addressSpace         = {
                  + addressPrefixes = [
                      + "28.0.0.0/16",
                    ]
                }
              + bgpCommunities       = null
              + ddosProtectionPlan   = null
              + dhcpOptions          = {
                  + dnsServers = [
                      + "8.8.8.8",
                    ]
                }
              + enableDdosProtection = false
              + enableVmProtection   = false
              + encryption           = null
              + flowTimeoutInMinutes = null
            }
        }
      + create_headers            = {
          + "User-Agent" = (known after apply)
        }
      + delete_headers            = {
          + "User-Agent" = (known after apply)
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + location                  = "East US"
      + name                      = "TestVNet3"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/4bcc135f-80a8-482f-b67b-fc849aa4b7ac/resourceGroups/Testrg1"
      + read_headers              = {
          + "User-Agent" = (known after apply)
        }
      + response_export_values    = []
      + retry                     = {
          + error_message_regex  = [
              + "ReferencedResourceNotProvisioned",
            ]
          + interval_seconds     = 10
          + max_interval_seconds = 180
          + multiplier           = 1.5
          + randomization_factor = 0.5
        }
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.Network/virtualNetworks@2024-07-01"
      + update_headers            = {
          + "User-Agent" = (known after apply)
        }

      + timeouts {
          + create = "30m"
          + delete = "30m"
          + read   = "5m"
          + update = "30m"
        }
    }

  # module.rdc_vnets.module.that.module.vnets.modtm_telemetry.telemetry[0] will be created
  + resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
      + id               = (known after apply)
      + nonce            = (known after apply)
      + tags             = {
          + "location"        = "East US"
          + "module_source"   = "registry.terraform.io/Azure/avm-res-network-virtualnetwork/azurerm"
          + "module_version"  = "0.16.0"
          + "random_id"       = (known after apply)
          + "subscription_id" = "4bcc135f-80a8-482f-b67b-fc849aa4b7ac"
          + "tenant_id"       = "71356f31-4de2-4bc5-9778-f530a487e6dc"
        }
    }

  # module.rdc_vnets.module.that.module.vnets.random_uuid.telemetry[0] will be created
  + resource "random_uuid" "telemetry" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.rdc_vnets.module.this.module.vnets.azapi_resource.vnet will be created
  + resource "azapi_resource" "vnet" {
      + body                      = {
          + extendedLocation = null
          + properties       = {
              + addressSpace         = {
                  + addressPrefixes = [
                      + "10.0.0.0/16",
                    ]
                }
              + bgpCommunities       = null
              + ddosProtectionPlan   = null
              + dhcpOptions          = {
                  + dnsServers = [
                      + "8.8.8.8",
                    ]
                }
              + enableDdosProtection = false
              + enableVmProtection   = false
              + encryption           = null
              + flowTimeoutInMinutes = null
            }
        }
      + create_headers            = {
          + "User-Agent" = (known after apply)
        }
      + delete_headers            = {
          + "User-Agent" = (known after apply)
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + location                  = "East US"
      + name                      = "TestVNet2"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/4bcc135f-80a8-482f-b67b-fc849aa4b7ac/resourceGroups/Testrg1"
      + read_headers              = {
          + "User-Agent" = (known after apply)
        }
      + response_export_values    = []
      + retry                     = {
          + error_message_regex  = [
              + "ReferencedResourceNotProvisioned",
            ]
          + interval_seconds     = 10
          + max_interval_seconds = 180
          + multiplier           = 1.5
          + randomization_factor = 0.5
        }
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.Network/virtualNetworks@2024-07-01"
      + update_headers            = {
          + "User-Agent" = (known after apply)
        }

      + timeouts {
          + create = "30m"
          + delete = "30m"
          + read   = "5m"
          + update = "30m"
        }
    }

  # module.rdc_vnets.module.this.module.vnets.modtm_telemetry.telemetry[0] will be created
  + resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
      + id               = (known after apply)
      + nonce            = (known after apply)
      + tags             = {
          + "location"        = "East US"
          + "module_source"   = "registry.terraform.io/Azure/avm-res-network-virtualnetwork/azurerm"
          + "module_version"  = "0.16.0"
          + "random_id"       = (known after apply)
          + "subscription_id" = "4bcc135f-80a8-482f-b67b-fc849aa4b7ac"
          + "tenant_id"       = "71356f31-4de2-4bc5-9778-f530a487e6dc"
        }
    }

  # module.rdc_vnets.module.this.module.vnets.random_uuid.telemetry[0] will be created
  + resource "random_uuid" "telemetry" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.rdc_vnets.module.vnet-10-0-0-0-tst-lol-numbers-cool.module.vnets.azapi_resource.vnet will be created
  + resource "azapi_resource" "vnet" {
      + body                      = {
          + extendedLocation = null
          + properties       = {
              + addressSpace         = {
                  + addressPrefixes = [
                      + "10.0.0.0/16",
                    ]
                }
              + bgpCommunities       = null
              + ddosProtectionPlan   = null
              + dhcpOptions          = {
                  + dnsServers = [
                      + "8.8.8.8",
                    ]
                }
              + enableDdosProtection = false
              + enableVmProtection   = false
              + encryption           = null
              + flowTimeoutInMinutes = null
            }
        }
      + create_headers            = {
          + "User-Agent" = (known after apply)
        }
      + delete_headers            = {
          + "User-Agent" = (known after apply)
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + location                  = "East US"
      + name                      = "TestVNet"
      + output                    = (known after apply)
      + parent_id                 = "/subscriptions/4bcc135f-80a8-482f-b67b-fc849aa4b7ac/resourceGroups/Testrg1"
      + read_headers              = {
          + "User-Agent" = (known after apply)
        }
      + response_export_values    = []
      + retry                     = {
          + error_message_regex  = [
              + "ReferencedResourceNotProvisioned",
            ]
          + interval_seconds     = 10
          + max_interval_seconds = 180
          + multiplier           = 1.5
          + randomization_factor = 0.5
        }
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.Network/virtualNetworks@2024-07-01"
      + update_headers            = {
          + "User-Agent" = (known after apply)
        }

      + timeouts {
          + create = "30m"
          + delete = "30m"
          + read   = "5m"
          + update = "30m"
        }
    }

  # module.rdc_vnets.module.vnet-10-0-0-0-tst-lol-numbers-cool.module.vnets.modtm_telemetry.telemetry[0] will be created
  + resource "modtm_telemetry" "telemetry" {
      + ephemeral_number = (known after apply)
      + id               = (known after apply)
      + nonce            = (known after apply)
      + tags             = {
          + "location"        = "East US"
          + "module_source"   = "registry.terraform.io/Azure/avm-res-network-virtualnetwork/azurerm"
          + "module_version"  = "0.16.0"
          + "random_id"       = (known after apply)
          + "subscription_id" = "4bcc135f-80a8-482f-b67b-fc849aa4b7ac"
          + "tenant_id"       = "71356f31-4de2-4bc5-9778-f530a487e6dc"
        }
    }

  # module.rdc_vnets.module.vnet-10-0-0-0-tst-lol-numbers-cool.module.vnets.random_uuid.telemetry[0] will be created
  + resource "random_uuid" "telemetry" {
      + id     = (known after apply)
      + result = (known after apply)
    }

  # module.rdc_vnets.module.example_vnet.module.vnets.module.subnet["snet-app"].azapi_resource.subnet[0] will be created
  + resource "azapi_resource" "subnet" {
      + body                      = {
          + properties = {
              + addressPrefix                     = null
              + addressPrefixes                   = [
                  + "10.42.1.0/24",
                ]
              + defaultOutboundAccess             = false
              + delegations                       = []
              + natGateway                        = null
              + networkSecurityGroup              = null
              + privateEndpointNetworkPolicies    = "Enabled"
              + privateLinkServiceNetworkPolicies = "Enabled"
              + routeTable                        = null
              + serviceEndpointPolicies           = null
              + serviceEndpoints                  = null
              + sharingScope                      = null
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + locks                     = [
          + (known after apply),
        ]
      + name                      = "snet-app"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + response_export_values    = [
          + "properties.addressPrefixes",
          + "properties.addressPrefix",
        ]
      + retry                     = {
          + error_message_regex  = [
              + "ReferencedResourceNotProvisioned",
            ]
          + interval_seconds     = 10
          + max_interval_seconds = 180
          + multiplier           = 1.5
          + randomization_factor = 0.5
        }
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.Network/virtualNetworks/subnets@2024-07-01"

      + timeouts {
          + create = "30m"
          + delete = "30m"
          + read   = "5m"
          + update = "30m"
        }
    }

  # module.rdc_vnets.module.example_vnet.module.vnets.module.subnet["snet-db"].azapi_resource.subnet[0] will be created
  + resource "azapi_resource" "subnet" {
      + body                      = {
          + properties = {
              + addressPrefix                     = null
              + addressPrefixes                   = [
                  + "10.42.2.0/24",
                ]
              + defaultOutboundAccess             = false
              + delegations                       = []
              + natGateway                        = null
              + networkSecurityGroup              = null
              + privateEndpointNetworkPolicies    = "Enabled"
              + privateLinkServiceNetworkPolicies = "Enabled"
              + routeTable                        = null
              + serviceEndpointPolicies           = null
              + serviceEndpoints                  = null
              + sharingScope                      = null
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + locks                     = [
          + (known after apply),
        ]
      + name                      = "snet-db"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + response_export_values    = [
          + "properties.addressPrefixes",
          + "properties.addressPrefix",
        ]
      + retry                     = {
          + error_message_regex  = [
              + "ReferencedResourceNotProvisioned",
            ]
          + interval_seconds     = 10
          + max_interval_seconds = 180
          + multiplier           = 1.5
          + randomization_factor = 0.5
        }
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.Network/virtualNetworks/subnets@2024-07-01"

      + timeouts {
          + create = "30m"
          + delete = "30m"
          + read   = "5m"
          + update = "30m"
        }
    }

  # module.rdc_vnets.module.that.module.vnets.module.subnet["subnet1"].azapi_resource.subnet[0] will be created
  + resource "azapi_resource" "subnet" {
      + body                      = {
          + properties = {
              + addressPrefix                     = null
              + addressPrefixes                   = [
                  + "28.0.128.0/24",
                ]
              + defaultOutboundAccess             = false
              + delegations                       = []
              + natGateway                        = null
              + networkSecurityGroup              = null
              + privateEndpointNetworkPolicies    = "Enabled"
              + privateLinkServiceNetworkPolicies = "Enabled"
              + routeTable                        = null
              + serviceEndpointPolicies           = null
              + serviceEndpoints                  = null
              + sharingScope                      = null
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + locks                     = [
          + (known after apply),
        ]
      + name                      = "subnet1"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + response_export_values    = [
          + "properties.addressPrefixes",
          + "properties.addressPrefix",
        ]
      + retry                     = {
          + error_message_regex  = [
              + "ReferencedResourceNotProvisioned",
            ]
          + interval_seconds     = 10
          + max_interval_seconds = 180
          + multiplier           = 1.5
          + randomization_factor = 0.5
        }
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.Network/virtualNetworks/subnets@2024-07-01"

      + timeouts {
          + create = "30m"
          + delete = "30m"
          + read   = "5m"
          + update = "30m"
        }
    }

  # module.rdc_vnets.module.that.module.vnets.module.subnet["subnet2"].azapi_resource.subnet[0] will be created
  + resource "azapi_resource" "subnet" {
      + body                      = {
          + properties = {
              + addressPrefix                     = null
              + addressPrefixes                   = [
                  + "28.0.130.0/24",
                ]
              + defaultOutboundAccess             = false
              + delegations                       = []
              + natGateway                        = null
              + networkSecurityGroup              = null
              + privateEndpointNetworkPolicies    = "Enabled"
              + privateLinkServiceNetworkPolicies = "Enabled"
              + routeTable                        = null
              + serviceEndpointPolicies           = null
              + serviceEndpoints                  = null
              + sharingScope                      = null
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + locks                     = [
          + (known after apply),
        ]
      + name                      = "subnet2"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + response_export_values    = [
          + "properties.addressPrefixes",
          + "properties.addressPrefix",
        ]
      + retry                     = {
          + error_message_regex  = [
              + "ReferencedResourceNotProvisioned",
            ]
          + interval_seconds     = 10
          + max_interval_seconds = 180
          + multiplier           = 1.5
          + randomization_factor = 0.5
        }
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.Network/virtualNetworks/subnets@2024-07-01"

      + timeouts {
          + create = "30m"
          + delete = "30m"
          + read   = "5m"
          + update = "30m"
        }
    }

  # module.rdc_vnets.module.this.module.vnets.module.subnet["subnet1"].azapi_resource.subnet[0] will be created
  + resource "azapi_resource" "subnet" {
      + body                      = {
          + properties = {
              + addressPrefix                     = null
              + addressPrefixes                   = [
                  + "10.0.25.0/24",
                ]
              + defaultOutboundAccess             = false
              + delegations                       = []
              + natGateway                        = null
              + networkSecurityGroup              = null
              + privateEndpointNetworkPolicies    = "Enabled"
              + privateLinkServiceNetworkPolicies = "Enabled"
              + routeTable                        = null
              + serviceEndpointPolicies           = null
              + serviceEndpoints                  = null
              + sharingScope                      = null
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + locks                     = [
          + (known after apply),
        ]
      + name                      = "subnet1"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + response_export_values    = [
          + "properties.addressPrefixes",
          + "properties.addressPrefix",
        ]
      + retry                     = {
          + error_message_regex  = [
              + "ReferencedResourceNotProvisioned",
            ]
          + interval_seconds     = 10
          + max_interval_seconds = 180
          + multiplier           = 1.5
          + randomization_factor = 0.5
        }
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.Network/virtualNetworks/subnets@2024-07-01"

      + timeouts {
          + create = "30m"
          + delete = "30m"
          + read   = "5m"
          + update = "30m"
        }
    }

  # module.rdc_vnets.module.this.module.vnets.module.subnet["subnet2"].azapi_resource.subnet[0] will be created
  + resource "azapi_resource" "subnet" {
      + body                      = {
          + properties = {
              + addressPrefix                     = null
              + addressPrefixes                   = [
                  + "10.0.35.0/24",
                ]
              + defaultOutboundAccess             = false
              + delegations                       = []
              + natGateway                        = null
              + networkSecurityGroup              = null
              + privateEndpointNetworkPolicies    = "Enabled"
              + privateLinkServiceNetworkPolicies = "Enabled"
              + routeTable                        = null
              + serviceEndpointPolicies           = null
              + serviceEndpoints                  = null
              + sharingScope                      = null
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + locks                     = [
          + (known after apply),
        ]
      + name                      = "subnet2"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + response_export_values    = [
          + "properties.addressPrefixes",
          + "properties.addressPrefix",
        ]
      + retry                     = {
          + error_message_regex  = [
              + "ReferencedResourceNotProvisioned",
            ]
          + interval_seconds     = 10
          + max_interval_seconds = 180
          + multiplier           = 1.5
          + randomization_factor = 0.5
        }
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.Network/virtualNetworks/subnets@2024-07-01"

      + timeouts {
          + create = "30m"
          + delete = "30m"
          + read   = "5m"
          + update = "30m"
        }
    }

  # module.rdc_vnets.module.vnet-10-0-0-0-tst-lol-numbers-cool.module.vnets.module.subnet["subnet1"].azapi_resource.subnet[0] will be created
  + resource "azapi_resource" "subnet" {
      + body                      = {
          + properties = {
              + addressPrefix                     = null
              + addressPrefixes                   = [
                  + "10.0.32.0/24",
                ]
              + defaultOutboundAccess             = false
              + delegations                       = []
              + natGateway                        = null
              + networkSecurityGroup              = null
              + privateEndpointNetworkPolicies    = "Enabled"
              + privateLinkServiceNetworkPolicies = "Enabled"
              + routeTable                        = null
              + serviceEndpointPolicies           = null
              + serviceEndpoints                  = null
              + sharingScope                      = null
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + locks                     = [
          + (known after apply),
        ]
      + name                      = "subnet1"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + response_export_values    = [
          + "properties.addressPrefixes",
          + "properties.addressPrefix",
        ]
      + retry                     = {
          + error_message_regex  = [
              + "ReferencedResourceNotProvisioned",
            ]
          + interval_seconds     = 10
          + max_interval_seconds = 180
          + multiplier           = 1.5
          + randomization_factor = 0.5
        }
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.Network/virtualNetworks/subnets@2024-07-01"

      + timeouts {
          + create = "30m"
          + delete = "30m"
          + read   = "5m"
          + update = "30m"
        }
    }

  # module.rdc_vnets.module.vnet-10-0-0-0-tst-lol-numbers-cool.module.vnets.module.subnet["subnet2"].azapi_resource.subnet[0] will be created
  + resource "azapi_resource" "subnet" {
      + body                      = {
          + properties = {
              + addressPrefix                     = null
              + addressPrefixes                   = [
                  + "10.0.240.0/24",
                ]
              + defaultOutboundAccess             = false
              + delegations                       = []
              + natGateway                        = null
              + networkSecurityGroup              = null
              + privateEndpointNetworkPolicies    = "Enabled"
              + privateLinkServiceNetworkPolicies = "Enabled"
              + routeTable                        = null
              + serviceEndpointPolicies           = null
              + serviceEndpoints                  = null
              + sharingScope                      = null
            }
        }
      + id                        = (known after apply)
      + ignore_casing             = false
      + ignore_missing_property   = true
      + ignore_null_property      = false
      + locks                     = [
          + (known after apply),
        ]
      + name                      = "subnet2"
      + output                    = (known after apply)
      + parent_id                 = (known after apply)
      + response_export_values    = [
          + "properties.addressPrefixes",
          + "properties.addressPrefix",
        ]
      + retry                     = {
          + error_message_regex  = [
              + "ReferencedResourceNotProvisioned",
            ]
          + interval_seconds     = 10
          + max_interval_seconds = 180
          + multiplier           = 1.5
          + randomization_factor = 0.5
        }
      + schema_validation_enabled = true
      + sensitive_body            = (write-only attribute)
      + type                      = "Microsoft.Network/virtualNetworks/subnets@2024-07-01"

      + timeouts {
          + create = "30m"
          + delete = "30m"
          + read   = "5m"
          + update = "30m"
        }
    }

Plan: 20 to add, 0 to change, 0 to destroy.

Run status: planned and saved (confirmable)
Workspace is unlocked
```
</details>